ninetyninecats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "yellow"], ["description", "                Felix the cat is too cool.\r\n  \r\n  \r\n  \r\n  "], ["updated_at", "2019-04-03 00:31:51.716038"], ["id", 1]]
---
  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update_attributes(cat_params)